/* automatically generated by rust-bindgen */

pub const VSL_STATUS_OK: u32 = 0;
pub const VSL_ERROR_OK: u32 = 0;
pub const VSL_ERROR_FEATURE_NOT_IMPLEMENTED: i32 = -1;
pub const VSL_ERROR_UNKNOWN: i32 = -2;
pub const VSL_ERROR_BADARGS: i32 = -3;
pub const VSL_ERROR_MEM_FAILURE: i32 = -4;
pub const VSL_ERROR_NULL_PTR: i32 = -5;
pub const VSL_ERROR_CPU_NOT_SUPPORTED: i32 = -6;
pub const VSL_RNG_ERROR_INVALID_BRNG_INDEX: i32 = -1000;
pub const VSL_RNG_ERROR_LEAPFROG_UNSUPPORTED: i32 = -1002;
pub const VSL_RNG_ERROR_SKIPAHEAD_UNSUPPORTED: i32 = -1003;
pub const VSL_RNG_ERROR_BRNGS_INCOMPATIBLE: i32 = -1005;
pub const VSL_RNG_ERROR_BAD_STREAM: i32 = -1006;
pub const VSL_RNG_ERROR_BRNG_TABLE_FULL: i32 = -1007;
pub const VSL_RNG_ERROR_BAD_STREAM_STATE_SIZE: i32 = -1008;
pub const VSL_RNG_ERROR_BAD_WORD_SIZE: i32 = -1009;
pub const VSL_RNG_ERROR_BAD_NSEEDS: i32 = -1010;
pub const VSL_RNG_ERROR_BAD_NBITS: i32 = -1011;
pub const VSL_RNG_ERROR_QRNG_PERIOD_ELAPSED: i32 = -1012;
pub const VSL_RNG_ERROR_LEAPFROG_NSTREAMS_TOO_BIG: i32 = -1013;
pub const VSL_RNG_ERROR_BRNG_NOT_SUPPORTED: i32 = -1014;
pub const VSL_RNG_ERROR_BAD_UPDATE: i32 = -1120;
pub const VSL_RNG_ERROR_NO_NUMBERS: i32 = -1121;
pub const VSL_RNG_ERROR_INVALID_ABSTRACT_STREAM: i32 = -1122;
pub const VSL_RNG_ERROR_NONDETERM_NOT_SUPPORTED: i32 = -1130;
pub const VSL_RNG_ERROR_NONDETERM_NRETRIES_EXCEEDED: i32 = -1131;
pub const VSL_RNG_ERROR_ARS5_NOT_SUPPORTED: i32 = -1140;

pub const VSL_SS_ED_SORTED_OBSERV: u32 = 78;
pub const VSL_SS_ED_SORTED_OBSERV_STORAGE: u32 = 79;
pub const VSL_SS_MEAN: u32 = 1;
pub const VSL_SS_2R_MOM: u32 = 2;
pub const VSL_SS_3R_MOM: u32 = 4;
pub const VSL_SS_4R_MOM: u32 = 8;
pub const VSL_SS_2C_MOM: u32 = 16;
pub const VSL_SS_3C_MOM: u32 = 32;
pub const VSL_SS_4C_MOM: u32 = 64;
pub const VSL_SS_SUM: u32 = 33554432;
pub const VSL_SS_2R_SUM: u32 = 67108864;
pub const VSL_SS_3R_SUM: u32 = 134217728;
pub const VSL_SS_4R_SUM: u32 = 268435456;
pub const VSL_SS_2C_SUM: u32 = 536870912;
pub const VSL_SS_3C_SUM: u32 = 1073741824;
pub const VSL_SS_4C_SUM: u32 = 2147483648;
pub const VSL_SS_KURTOSIS: u32 = 128;
pub const VSL_SS_SKEWNESS: u32 = 256;
pub const VSL_SS_VARIATION: u32 = 512;
pub const VSL_SS_MIN: u32 = 1024;
pub const VSL_SS_MAX: u32 = 2048;
pub const VSL_SS_COV: u32 = 4096;
pub const VSL_SS_COR: u32 = 8192;
pub const VSL_SS_CP: u64 = 4294967296;
pub const VSL_SS_POOLED_COV: u32 = 16384;
pub const VSL_SS_GROUP_COV: u32 = 32768;
pub const VSL_SS_POOLED_MEAN: u64 = 34359738368;
pub const VSL_SS_GROUP_MEAN: u64 = 68719476736;
pub const VSL_SS_QUANTS: u32 = 65536;
pub const VSL_SS_ORDER_STATS: u32 = 131072;
pub const VSL_SS_SORTED_OBSERV: u64 = 549755813888;
pub const VSL_SS_ROBUST_COV: u32 = 262144;
pub const VSL_SS_OUTLIERS: u32 = 524288;
pub const VSL_SS_PARTIAL_COV: u32 = 1048576;
pub const VSL_SS_PARTIAL_COR: u32 = 2097152;
pub const VSL_SS_MISSING_VALS: u32 = 4194304;
pub const VSL_SS_PARAMTR_COR: u32 = 8388608;
pub const VSL_SS_STREAM_QUANTS: u32 = 16777216;
pub const VSL_SS_MDAD: u64 = 8589934592;
pub const VSL_SS_MNAD: u64 = 17179869184;
pub const MKL_DOMAIN_ALL: u32 = 0;
pub const MKL_DOMAIN_BLAS: u32 = 1;
pub const MKL_DOMAIN_FFT: u32 = 2;
pub const MKL_DOMAIN_VML: u32 = 3;
pub const MKL_DOMAIN_PARDISO: u32 = 4;
pub const MKL_CBWR_BRANCH: u32 = 1;
pub const MKL_CBWR_ALL: i32 = -1;
pub const MKL_CBWR_STRICT: u32 = 65536;
pub const MKL_CBWR_OFF: u32 = 0;
pub const MKL_CBWR_BRANCH_OFF: u32 = 1;
pub const MKL_CBWR_AUTO: u32 = 2;
pub const MKL_CBWR_COMPATIBLE: u32 = 3;
pub const MKL_CBWR_SSE2: u32 = 4;
pub const MKL_CBWR_SSSE3: u32 = 6;
pub const MKL_CBWR_SSE4_1: u32 = 7;
pub const MKL_CBWR_SSE4_2: u32 = 8;
pub const MKL_CBWR_AVX: u32 = 9;
pub const MKL_CBWR_AVX2: u32 = 10;
pub const MKL_CBWR_AVX512_MIC: u32 = 11;
pub const MKL_CBWR_AVX512: u32 = 12;
pub const MKL_CBWR_AVX512_MIC_E1: u32 = 13;
pub const MKL_CBWR_AVX512_E1: u32 = 14;
pub const MKL_CBWR_SUCCESS: u32 = 0;
pub const MKL_CBWR_ERR_INVALID_SETTINGS: i32 = -1;
pub const MKL_CBWR_ERR_INVALID_INPUT: i32 = -2;
pub const MKL_CBWR_ERR_UNSUPPORTED_BRANCH: i32 = -3;
pub const MKL_CBWR_ERR_UNKNOWN_BRANCH: i32 = -4;
pub const MKL_CBWR_ERR_MODE_CHANGE_FAILURE: i32 = -8;
pub const MKL_CBWR_SSE3: u32 = 5;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MKL_Complex8 {
    pub real: f32,
    pub imag: f32,
}
#[test]
fn bindgen_test_layout__MKL_Complex8() {
    assert_eq!(
        ::std::mem::size_of::<_MKL_Complex8>(),
        8usize,
        concat!("Size of: ", stringify!(_MKL_Complex8))
    );
    assert_eq!(
        ::std::mem::align_of::<_MKL_Complex8>(),
        4usize,
        concat!("Alignment of ", stringify!(_MKL_Complex8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MKL_Complex8>())).real as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_MKL_Complex8),
            "::",
            stringify!(real)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MKL_Complex8>())).imag as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_MKL_Complex8),
            "::",
            stringify!(imag)
        )
    );
}
pub type MKL_Complex8 = _MKL_Complex8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MKL_Complex16 {
    pub real: f64,
    pub imag: f64,
}
#[test]
fn bindgen_test_layout__MKL_Complex16() {
    assert_eq!(
        ::std::mem::size_of::<_MKL_Complex16>(),
        16usize,
        concat!("Size of: ", stringify!(_MKL_Complex16))
    );
    assert_eq!(
        ::std::mem::align_of::<_MKL_Complex16>(),
        8usize,
        concat!("Alignment of ", stringify!(_MKL_Complex16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MKL_Complex16>())).real as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_MKL_Complex16),
            "::",
            stringify!(real)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_MKL_Complex16>())).imag as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_MKL_Complex16),
            "::",
            stringify!(imag)
        )
    );
}
pub type MKL_Complex16 = _MKL_Complex16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MKLVersion {
    pub MajorVersion: ::std::os::raw::c_int,
    pub MinorVersion: ::std::os::raw::c_int,
    pub UpdateVersion: ::std::os::raw::c_int,
    pub ProductStatus: *mut ::std::os::raw::c_char,
    pub Build: *mut ::std::os::raw::c_char,
    pub Processor: *mut ::std::os::raw::c_char,
    pub Platform: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_MKLVersion() {
    assert_eq!(
        ::std::mem::size_of::<MKLVersion>(),
        48usize,
        concat!("Size of: ", stringify!(MKLVersion))
    );
    assert_eq!(
        ::std::mem::align_of::<MKLVersion>(),
        8usize,
        concat!("Alignment of ", stringify!(MKLVersion))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MKLVersion>())).MajorVersion as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(MajorVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MKLVersion>())).MinorVersion as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(MinorVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MKLVersion>())).UpdateVersion as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(UpdateVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MKLVersion>())).ProductStatus as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(ProductStatus)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MKLVersion>())).Build as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(Build)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MKLVersion>())).Processor as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(Processor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MKLVersion>())).Platform as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MKLVersion),
            "::",
            stringify!(Platform)
        )
    );
}
pub const MKL_LAYOUT_MKL_ROW_MAJOR: MKL_LAYOUT = 101;
pub const MKL_LAYOUT_MKL_COL_MAJOR: MKL_LAYOUT = 102;
pub type MKL_LAYOUT = u32;
pub const MKL_TRANSPOSE_MKL_NOTRANS: MKL_TRANSPOSE = 111;
pub const MKL_TRANSPOSE_MKL_TRANS: MKL_TRANSPOSE = 112;
pub const MKL_TRANSPOSE_MKL_CONJTRANS: MKL_TRANSPOSE = 113;
pub type MKL_TRANSPOSE = u32;
pub const MKL_UPLO_MKL_UPPER: MKL_UPLO = 121;
pub const MKL_UPLO_MKL_LOWER: MKL_UPLO = 122;
pub type MKL_UPLO = u32;
pub const MKL_DIAG_MKL_NONUNIT: MKL_DIAG = 131;
pub const MKL_DIAG_MKL_UNIT: MKL_DIAG = 132;
pub type MKL_DIAG = u32;
pub const MKL_SIDE_MKL_LEFT: MKL_SIDE = 141;
pub const MKL_SIDE_MKL_RIGHT: MKL_SIDE = 142;
pub type MKL_SIDE = u32;
pub const MKL_COMPACT_PACK_MKL_COMPACT_SSE: MKL_COMPACT_PACK = 181;
pub const MKL_COMPACT_PACK_MKL_COMPACT_AVX: MKL_COMPACT_PACK = 182;
pub const MKL_COMPACT_PACK_MKL_COMPACT_AVX512: MKL_COMPACT_PACK = 183;
pub type MKL_COMPACT_PACK = u32;
pub type sgemm_jit_kernel_t =
    ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void,
                             arg2: *mut f32,
                             arg3: *mut f32,
                             arg4: *mut f32),
    >;
pub type dgemm_jit_kernel_t =
    ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void,
                             arg2: *mut f64,
                             arg3: *mut f64,
                             arg4: *mut f64),
    >;
pub type cgemm_jit_kernel_t =
    ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void,
                             arg2: *mut MKL_Complex8,
                             arg3: *mut MKL_Complex8,
                             arg4: *mut MKL_Complex8),
    >;
pub type zgemm_jit_kernel_t =
    ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void,
                             arg2: *mut MKL_Complex16,
                             arg3: *mut MKL_Complex16,
                             arg4: *mut MKL_Complex16),
    >;
pub const mkl_jit_status_t_MKL_JIT_SUCCESS: mkl_jit_status_t = 0;
pub const mkl_jit_status_t_MKL_NO_JIT: mkl_jit_status_t = 1;
pub const mkl_jit_status_t_MKL_JIT_ERROR: mkl_jit_status_t = 2;
pub type mkl_jit_status_t = u32;
pub type VSLStreamStatePtr = *mut ::std::os::raw::c_void;
pub type VSLConvTaskPtr = *mut ::std::os::raw::c_void;
pub type VSLCorrTaskPtr = *mut ::std::os::raw::c_void;
pub type VSLSSTaskPtr = *mut ::std::os::raw::c_void;
pub type InitStreamPtr =
    ::std::option::Option<
        unsafe extern "C" fn(method: ::std::os::raw::c_int,
                             stream: VSLStreamStatePtr,
                             n: ::std::os::raw::c_int,
                             params: *const ::std::os::raw::c_uint)
                             -> ::std::os::raw::c_int,
    >;
pub type sBRngPtr = ::std::option::Option<
    unsafe extern "C" fn(stream: VSLStreamStatePtr,
                         n: ::std::os::raw::c_int,
                         r: *mut f32,
                         a: f32,
                         b: f32)
                         -> ::std::os::raw::c_int,
>;
pub type dBRngPtr = ::std::option::Option<
    unsafe extern "C" fn(stream: VSLStreamStatePtr,
                         n: ::std::os::raw::c_int,
                         r: *mut f64,
                         a: f64,
                         b: f64)
                         -> ::std::os::raw::c_int,
>;
pub type iBRngPtr = ::std::option::Option<
    unsafe extern "C" fn(stream: VSLStreamStatePtr,
                         n: ::std::os::raw::c_int,
                         r: *mut ::std::os::raw::c_uint)
                         -> ::std::os::raw::c_int,
>;
#[doc = " Pointers to callback functions for abstract streams"]
pub type iUpdateFuncPtr =
    ::std::option::Option<
        unsafe extern "C" fn(stream: VSLStreamStatePtr,
                             n: *mut ::std::os::raw::c_int,
                             ibuf: *mut ::std::os::raw::c_uint,
                             nmin: *mut ::std::os::raw::c_int,
                             nmax: *mut ::std::os::raw::c_int,
                             idx: *mut ::std::os::raw::c_int)
                             -> ::std::os::raw::c_int,
    >;
pub type dUpdateFuncPtr =
    ::std::option::Option<
        unsafe extern "C" fn(stream: VSLStreamStatePtr,
                             n: *mut ::std::os::raw::c_int,
                             dbuf: *mut f64,
                             nmin: *mut ::std::os::raw::c_int,
                             nmax: *mut ::std::os::raw::c_int,
                             idx: *mut ::std::os::raw::c_int)
                             -> ::std::os::raw::c_int,
    >;
pub type sUpdateFuncPtr =
    ::std::option::Option<
        unsafe extern "C" fn(stream: VSLStreamStatePtr,
                             n: *mut ::std::os::raw::c_int,
                             sbuf: *mut f32,
                             nmin: *mut ::std::os::raw::c_int,
                             nmax: *mut ::std::os::raw::c_int,
                             idx: *mut ::std::os::raw::c_int)
                             -> ::std::os::raw::c_int,
    >;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _VSLBRngProperties {
    pub StreamStateSize: ::std::os::raw::c_int,
    pub NSeeds: ::std::os::raw::c_int,
    pub IncludesZero: ::std::os::raw::c_int,
    pub WordSize: ::std::os::raw::c_int,
    pub NBits: ::std::os::raw::c_int,
    pub InitStream: InitStreamPtr,
    pub sBRng: sBRngPtr,
    pub dBRng: dBRngPtr,
    pub iBRng: iBRngPtr,
}
#[test]
fn bindgen_test_layout__VSLBRngProperties() {
    assert_eq!(
        ::std::mem::size_of::<_VSLBRngProperties>(),
        56usize,
        concat!("Size of: ", stringify!(_VSLBRngProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<_VSLBRngProperties>(),
        8usize,
        concat!("Alignment of ", stringify!(_VSLBRngProperties))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VSLBRngProperties>())).StreamStateSize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_VSLBRngProperties),
            "::",
            stringify!(StreamStateSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VSLBRngProperties>())).NSeeds as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_VSLBRngProperties),
            "::",
            stringify!(NSeeds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VSLBRngProperties>())).IncludesZero as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_VSLBRngProperties),
            "::",
            stringify!(IncludesZero)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VSLBRngProperties>())).WordSize as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_VSLBRngProperties),
            "::",
            stringify!(WordSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VSLBRngProperties>())).NBits as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_VSLBRngProperties),
            "::",
            stringify!(NBits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VSLBRngProperties>())).InitStream as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_VSLBRngProperties),
            "::",
            stringify!(InitStream)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VSLBRngProperties>())).sBRng as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_VSLBRngProperties),
            "::",
            stringify!(sBRng)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VSLBRngProperties>())).dBRng as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_VSLBRngProperties),
            "::",
            stringify!(dBRng)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_VSLBRngProperties>())).iBRng as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_VSLBRngProperties),
            "::",
            stringify!(iBRng)
        )
    );
}
pub type VSLBRngProperties = _VSLBRngProperties;
extern "C" {
    pub fn vdRngCauchy(
        arg1: ::std::os::raw::c_int,
        arg2: VSLStreamStatePtr,
        arg3: ::std::os::raw::c_int,
        arg4: *mut f64,
        arg5: f64,
        arg6: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn VDRNGCAUCHY_(
        arg1: *const ::std::os::raw::c_int,
        arg2: *mut VSLStreamStatePtr,
        arg3: *const ::std::os::raw::c_int,
        arg4: *mut f64,
        arg5: *const f64,
        arg6: *const f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdrngcauchy_(
        arg1: *const ::std::os::raw::c_int,
        arg2: *mut VSLStreamStatePtr,
        arg3: *const ::std::os::raw::c_int,
        arg4: *mut f64,
        arg5: *const f64,
        arg6: *const f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
